def fn():
    print('这是我第一个函数')
    print('hello')
    print('今天天气真不错')


print(fn)  # <function fn at 0x0000020EB21D3560>
print(type(fn))  # <class 'function'>
print("-----------------------------------")
fn()
print("-----------------------------------")
fn()
print("-----------------------------------")
fn()
print("-----------------------------------")


# -----------------------------------
# 这是我第一个函数
# hello
# 今天天气真不错
# -----------------------------------
# 这是我第一个函数
# hello
# 今天天气真不错
# -----------------------------------
# 这是我第一个函数
# hello
# 今天天气真不错
# -----------------------------------

# 打印fn
def fn(a, b):
    print(a + b)

fn(1)
